bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY828.xml
                <register caption="Pull-up Enable Control Register" name="PUEC" offset="0x2B" size="1" mask="0xFF"/>
                <register caption="Port C Data Register" name="PORTC" offset="0x2A" size="1" mask="0xFF"/>
                <register caption="Data Direction Register, Port C" name="DDRC" offset="0x29" size="1" mask="0xFF"/>
                <register caption="Port C Input Pins" name="PINC" offset="0x28" size="1" mask="0xFF"/>
            </register-group>
            <register-group caption="I/O Port" name="PORTD">
                <register caption="Pull-up Enable Control Register" name="PUED" offset="0x2F" size="1" mask="0x0F"/>
                <register caption="Port D Data Register" name="PORTD" offset="0x2E" size="1" mask="0x0F"/>
                <register caption="Data Direction Register, Port D" name="DDRD" offset="0x2D" size="1" mask="0x0F"/>
                <register caption="Port D Input Pins" name="PIND" offset="0x2C" size="1" mask="0x0F"/>
            </register-group>
        </module>
        <module caption="CPU Registers" name="CPU">
            <register-group caption="CPU Registers" name="CPU">
                <register caption="Power Reduction Register" name="PRR" offset="0x64" size="1">
                    <bitfield caption="Power Reduction TWI" mask="0x80" name="PRTWI"/>
                    <bitfield caption="Power Reduction Timer/Counter0" mask="0x20" name="PRTIM0"/>
                    <bitfield caption="Power Reduction Timer/Counter1" mask="0x08" name="PRTIM1"/>
                    <bitfield caption="Power Reduction SPI" mask="0x04" name="PRSPI"/>
                    <bitfield caption="Power Reduction USART 0" mask="0x02" name="PRUSART0"/>
                    <bitfield caption="Power Reduction ADC" mask="0x01" name="PRADC"/>
                </register>
                <register caption="Configuration Change Protection" name="CCP" offset="0x56" size="1" mask="0xFF"/>
                <register caption="Clock Prescale Register" name="CLKPR" offset="0x61" size="1">
                    <bitfield caption="Clock Prescaler Select Bits" mask="0x0F" name="CLKPS"
                              values="CPU_CLK_PRESCALE_4_BITS_SMALL"/>
                </register>
                <register caption="Status Register" name="SREG" offset="0x5F" size="1">
                    <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
                    <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
                    <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
                    <bitfield caption="Sign Bit" mask="0x10" name="S"/>
                    <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
                    <bitfield caption="Negative Flag" mask="0x04" name="N"/>
                    <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
                    <bitfield caption="Carry Flag" mask="0x01" name="C"/>
                </register>
                <register caption="Stack Pointer " name="SP" offset="0x5D" size="2" mask="0x03FF"/>
                <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
                    <bitfield caption="Interrupt Vector Select" mask="0x02" name="IVSEL"/>
                </register>
                <register caption="MCU Status Register" name="MCUSR" offset="0x54" size="1">
                    <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
                    <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
                    <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
                    <bitfield caption="Power-on reset flag" mask="0x01" name="PORF"/>
                </register>
                <register caption="General Purpose I/O Register 2" name="GPIOR2" offset="0x4B" size="1" mask="0xFF"/>
                <register caption="General Purpose I/O Register 1" name="GPIOR1" offset="0x4A" size="1" mask="0xFF"/>
                <register caption="General Purpose I/O Register 0" name="GPIOR0" offset="0x3E" size="1" mask="0xFF"/>
                <register caption="Sleep Mode Control Register" name="SMCR" offset="0x53" size="1">
                    <bitfield caption="Sleep Mode Select Bits" mask="0x06" name="SM" values="CPU_SLEEP_MODE2"/>
                    <bitfield caption="Sleep Enable" mask="0x01" name="SE"/>
                </register>
                <register caption="Store Program Memory Control and Status Register" name="SPMCSR" offset="0x57"
                          size="1">
                    <bitfield caption="SPM Interrupt Enable" mask="0x80" name="SPMIE"/>
                    <bitfield caption="Read-While-Write Section Busy" mask="0x40" name="RWWSB"/>
                    <bitfield caption="Read Device Signature Imprint Table" mask="0x20" name="RSIG"/>
                    <bitfield caption="Read-While-Write section read enable" mask="0x10" name="RWWSRE"/>
                    <bitfield caption="Read/Write Fuse and Lock Bits" mask="0x08" name="RWFLB"/>
                    <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
                    <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
                    <bitfield caption="Store Program Memory Enable" mask="0x01" name="SPMEN"/>
                </register>
                <register caption="Oscillator Calibration Register 8MHz" name="OSCCAL0" offset="0x66" size="1"
                          mask="0xFF"/>
                <register caption="Oscillator Calibration Register 32kHz" name="OSCCAL1" offset="0x67" size="1"
                          mask="0x03"/>
                <register caption="Oscillator Temperature Calibration Register A" name="OSCTCAL0A" offset="0xF0"
                          size="1" mask="0xFF"/>
                <register caption="Oscillator Temperature Calibration Register B" name="OSCTCAL0B" offset="0xF1"
                          size="1" mask="0xFF"/>
            </register-group>
            <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
                <value value="0x00" caption="8.0 MHz" name="8_0_MHz"/>
                <value value="0x03" caption="32 kHz" name="32_kHz"/>
            </value-group>
