bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY828.xml
                <register caption="Digital Input Disable Register 1" name="DIDR1" offset="0x7F" size="1">
                    <bitfield caption="ADC15 Digital input Disable" mask="0x80" name="ADC15D"/>
                    <bitfield caption="ADC14 Digital input Disable" mask="0x40" name="ADC14D"/>
                    <bitfield caption="ADC13 Digital input Disable" mask="0x20" name="ADC13D"/>
                    <bitfield caption="ADC12 Digital input Disable" mask="0x10" name="ADC12D"/>
                    <bitfield caption="ADC11 Digital input Disable" mask="0x08" name="ADC11D"/>
                    <bitfield caption="ADC10 Digital input Disable" mask="0x04" name="ADC10D"/>
                    <bitfield caption="ADC9 Digital input Disable" mask="0x02" name="ADC9D"/>
                    <bitfield caption="ADC8 Digital input Disable" mask="0x01" name="ADC8D"/>
                </register>
                <register caption="Digital Input Disable Register 0" name="DIDR0" offset="0x7E" size="1">
                    <bitfield caption="ADC7 Digital input Disable" mask="0x80" name="ADC7D"/>
                    <bitfield caption="ADC6 Digital input Disable" mask="0x40" name="ADC6D"/>
                    <bitfield caption="ADC5 Digital input Disable" mask="0x20" name="ADC5D"/>
                    <bitfield caption="ADC4 Digital input Disable" mask="0x10" name="ADC4D"/>
                    <bitfield caption="ADC3 Digital input Disable" mask="0x08" name="ADC3D"/>
                    <bitfield caption="ADC2 Digital input Disable" mask="0x04" name="ADC2D"/>
                    <bitfield caption="ADC1 Digital input Disable" mask="0x02" name="ADC1D"/>
                    <bitfield caption="ADC0 Digital input Disable" mask="0x01" name="ADC0D"/>
                </register>
            </register-group>
            <value-group caption="" name="ANALOG_ADC_PRESCALER">
                <value caption="2" name="VAL_0x00" value="0x00"/>
                <value caption="2" name="VAL_0x01" value="0x01"/>
                <value caption="4" name="VAL_0x02" value="0x02"/>
                <value caption="8" name="VAL_0x03" value="0x03"/>
                <value caption="16" name="VAL_0x04" value="0x04"/>
                <value caption="32" name="VAL_0x05" value="0x05"/>
                <value caption="64" name="VAL_0x06" value="0x06"/>
                <value caption="128" name="VAL_0x07" value="0x07"/>
            </value-group>
            <value-group caption="" name="ANALOG_ADC_AUTO_TRIGGER">
                <value caption="Free Running mode" name="VAL_0x00" value="0x00"/>
                <value caption="Analog Comparator" name="VAL_0x01" value="0x01"/>
                <value caption="External Interrupt Request 0" name="VAL_0x02" value="0x02"/>
                <value caption="Timer/Counter0 Compare Match A" name="VAL_0x03" value="0x03"/>
                <value caption="Timer/Counter0 Overflow" name="VAL_0x04" value="0x04"/>
                <value caption="Timer/Counter1 Compare Match B" name="VAL_0x05" value="0x05"/>
                <value caption="Timer/Counter1 Overflow" name="VAL_0x06" value="0x06"/>
                <value caption="Timer/Counter1 Capture Event" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Analog Comparator" name="AC">
            <register-group caption="Analog Comparator" name="AC">
                <register caption="Analog Comparator Control And Status Register B" name="ACSRB" offset="0x4F" size="1">
                    <bitfield caption="Hysteresis Select" mask="0x80" name="HSEL"/>
                    <bitfield caption="Hysteresis Level" mask="0x40" name="HLEV"/>
                    <bitfield caption="Analog Comparator Negative Input Multiplexer" mask="0x0C" name="ACNMUX"/>
                    <bitfield caption="Analog Comparator Positive Input Multiplexer Bits 1:0" mask="0x03"
                              name="ACPMUX"/>
                </register>
                <register caption="Analog Comparator Control And Status Register A" name="ACSRA" offset="0x50" size="1">
                    <bitfield caption="Analog Comparator Disable" mask="0x80" name="ACD"/>
                    <bitfield caption="Analog Comparator Positive Input Multiplexer Bit 2" mask="0x40" name="ACPMUX2"/>
                    <bitfield caption="Analog Compare Output" mask="0x20" name="ACO"/>
                    <bitfield caption="Analog Comparator Interrupt Flag" mask="0x10" name="ACI"/>
                    <bitfield caption="Analog Comparator Interrupt Enable" mask="0x08" name="ACIE"/>
                    <bitfield caption="Analog Comparator Input Capture Enable" mask="0x04" name="ACIC"/>
                    <bitfield caption="Analog Comparator Interrupt Mode Select bits" mask="0x03" name="ACIS"
                              values="ANALOG_COMP_INTERRUPT"/>
                </register>
            </register-group>
            <value-group caption="" name="ANALOG_COMP_INTERRUPT">
                <value caption="Interrupt on Toggle" name="VAL_0x00" value="0x00"/>
                <value caption="Reserved" name="VAL_0x01" value="0x01"/>
                <value caption="Interrupt on Falling Edge" name="VAL_0x02" value="0x02"/>
                <value caption="Interrupt on Rising Edge" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="External Interrupts" name="EXINT">
            <register-group caption="External Interrupts" name="EXINT">
                <register caption="External Interrupt Control Register" name="EICRA" offset="0x69" size="1">
                    <bitfield caption="External Interrupt Sense Control 1 Bits" mask="0x0C" name="ISC1"
                              values="INTERRUPT_SENSE_CONTROL"/>
                    <bitfield caption="External Interrupt Sense Control 0 Bits" mask="0x03" name="ISC0"
                              values="INTERRUPT_SENSE_CONTROL"/>
                </register>
                <register caption="External Interrupt Mask Register" name="EIMSK" offset="0x3D" size="1">
                    <bitfield caption="External Interrupt Request Enables" mask="0x03" name="INT"/>
                </register>
                <register caption="External Interrupt Flag Register" name="EIFR" offset="0x3C" size="1" ocd-rw="R">
                    <bitfield caption="External Interrupt Flags" mask="0x03" name="INTF"/>
                </register>
                <register caption="Pin Change Interrupt Control Register" name="PCICR" offset="0x68" size="1">
                    <bitfield caption="Pin Change Interrupt Enables" mask="0x0F" name="PCIE"/>
                </register>
                <register caption="Pin Change Mask Register 3" name="PCMSK3" offset="0x73" size="1">
                    <bitfield caption="Pin Change Enable Masks" mask="0x0F" name="PCINT" lsb="24"/>
                </register>
                <register caption="Pin Change Mask Register 2" name="PCMSK2" offset="0x6D" size="1">
                    <bitfield caption="Pin Change Enable Masks" mask="0xFF" name="PCINT" lsb="16"/>
                </register>
