bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY828.xml
                <register caption="Pin Change Mask Register 1" name="PCMSK1" offset="0x6C" size="1">
                    <bitfield caption="Pin Change Enable Masks" mask="0xFF" name="PCINT" lsb="8"/>
                </register>
                <register caption="Pin Change Mask Register 0" name="PCMSK0" offset="0x6B" size="1">
                    <bitfield caption="Pin Change Enable Masks" mask="0xFF" name="PCINT"/>
                </register>
                <register caption="Pin Change Interrupt Flag Register" name="PCIFR" offset="0x3B" size="1" ocd-rw="R">
                    <bitfield caption="Pin Change Interrupt Flags" mask="0x0F" name="PCIF"/>
                </register>
            </register-group>
            <value-group caption="Interrupt Sense Control" name="INTERRUPT_SENSE_CONTROL">
                <value caption="Low Level of INTX" name="VAL_0x00" value="0x00"/>
                <value caption="Any Logical Change of INTX" name="VAL_0x01" value="0x01"/>
                <value caption="Falling Edge of INTX" name="VAL_0x02" value="0x02"/>
                <value caption="Rising Edge of INTX" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="Watchdog Timer" name="WDT">
            <register-group caption="Watchdog Timer" name="WDT">
                <register caption="Watchdog Timer Control and Status Register" name="WDTCSR" offset="0x60" size="1">
                    <bitfield caption="Watchdog Timer Interrupt Flag" mask="0x80" name="WDIF"/>
                    <bitfield caption="Watchdog Timer Interrupt Enable" mask="0x40" name="WDIE"/>
                    <bitfield caption="Watchdog Timer Prescaler Bits" mask="0x27" name="WDP"
                              values="WDOG_TIMER_PRESCALE_4BITS_32KHZ"/>
                    <bitfield caption="Watch Dog Enable" mask="0x08" name="WDE"/>
                </register>
            </register-group>
            <value-group caption="" name="WDOG_TIMER_PRESCALE_4BITS_32KHZ">
                <value caption="Oscillator Cycles 512 (16 ms)" name="VAL_0x00" value="0x00"/>
                <value caption="Oscillator Cycles 1K (32 ms)" name="VAL_0x01" value="0x01"/>
                <value caption="Oscillator Cycles 2K (64 ms)" name="VAL_0x02" value="0x02"/>
                <value caption="Oscillator Cycles 4K (0.125 s)" name="VAL_0x03" value="0x03"/>
                <value caption="Oscillator Cycles 8K (0.25 s)" name="VAL_0x04" value="0x04"/>
                <value caption="Oscillator Cycles 16K (0.5 s)" name="VAL_0x05" value="0x05"/>
                <value caption="Oscillator Cycles 32K (1.0 s)" name="VAL_0x06" value="0x06"/>
                <value caption="Oscillator Cycles 64K (2.0 s)" name="VAL_0x07" value="0x07"/>
                <value caption="Oscillator Cycles 128K (4.0 s)" name="VAL_0x08" value="0x08"/>
                <value caption="Oscillator Cycles 256K (8.0 s)" name="VAL_0x09" value="0x09"/>
            </value-group>
        </module>
        <module caption="EEPROM" name="EEPROM">
            <register-group caption="EEPROM" name="EEPROM">
                <register caption="EEPROM Read/Write Access" name="EEAR" offset="0x41" size="1" mask="0xFF"/>
                <register caption="EEPROM Data Register" name="EEDR" offset="0x40" size="1" mask="0xFF"/>
                <register caption="EEPROM Control Register" name="EECR" offset="0x3F" size="1">
                    <bitfield caption="EEPROM Programming Mode Bits" mask="0x30" name="EEPM" values="EEP_MODE"/>
                    <bitfield caption="EEProm Ready Interrupt Enable" mask="0x08" name="EERIE"/>
                    <bitfield caption="EEPROM Master Write Enable" mask="0x04" name="EEMPE"/>
                    <bitfield caption="EEPROM Write Enable" mask="0x02" name="EEPE"/>
                    <bitfield caption="EEPROM Read Enable" mask="0x01" name="EERE"/>
                </register>
            </register-group>
            <value-group caption="" name="EEP_MODE">
                <value caption="Erase and Write in one operation" name="VAL_0x00" value="0x00"/>
                <value caption="Erase Only" name="VAL_0x01" value="0x01"/>
                <value caption="Write Only" name="VAL_0x02" value="0x02"/>
            </value-group>
        </module>
        <module caption="Two Wire Serial Interface" name="TWI">
            <register-group caption="Two Wire Serial Interface" name="TWI">
                <register caption="TWI Slave Control Register A" name="TWSCRA" offset="0xB8" size="1">
                    <bitfield caption="TWI SDA Hold Time Enable" mask="0x80" name="TWSHE"/>
                    <bitfield caption="TWI Data Interrupt Enable" mask="0x20" name="TWDIE"/>
                    <bitfield caption="TWI Address/Stop Interrupt Enable" mask="0x10" name="TWASIE"/>
                    <bitfield caption="Two-Wire Interface Enable" mask="0x08" name="TWEN"/>
                    <bitfield caption="TWI Stop Interrupt Enable" mask="0x04" name="TWSIE"/>
                    <bitfield caption="TWI Promiscuous Mode Enable" mask="0x02" name="TWPME"/>
                    <bitfield caption="TWI Smart Mode Enable" mask="0x01" name="TWSME"/>
                </register>
                <register caption="TWI Slave Control Register B" name="TWSCRB" offset="0xB9" size="1">
                    <bitfield caption="TWI High Noise Mode" mask="0x08" name="TWHNM"/>
                    <bitfield caption="TWI Acknowledge Action" mask="0x04" name="TWAA"/>
                    <bitfield caption="" mask="0x03" name="TWCMD"/>
                </register>
                <register caption="TWI Slave Status Register A" name="TWSSRA" offset="0xBA" size="1">
                    <bitfield caption="TWI Data Interrupt Flag." mask="0x80" name="TWDIF"/>
                    <bitfield caption="TWI Address/Stop Interrupt Flag" mask="0x40" name="TWASIF"/>
                    <bitfield caption="TWI Clock Hold" mask="0x20" name="TWCH"/>
                    <bitfield caption="TWI Receive Acknowledge" mask="0x10" name="TWRA"/>
                    <bitfield caption="TWI Collision" mask="0x08" name="TWC"/>
                    <bitfield caption="TWI Bus Error" mask="0x04" name="TWBE"/>
                    <bitfield caption="TWI Read/Write Direction" mask="0x02" name="TWDIR"/>
                    <bitfield caption="TWI Address or Stop" mask="0x01" name="TWAS"/>
                </register>
