bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY828.xml
                <register caption="TWI Slave Address Register" name="TWSA" offset="0xBC" size="1" mask="0xFF"
                          ocd-rw="R"/>
                <register caption="TWI Slave Data Register" name="TWSD" offset="0xBD" size="1" ocd-rw="R">
                    <bitfield caption="TWI slave data bit" mask="0xFF" name="TWSD"/>
                </register>
                <register caption="TWI Slave Address Mask Register" name="TWSAM" offset="0xBB" size="1">
                    <bitfield caption="TWI Address Mask Bits" mask="0xFE" name="TWSAM" lsb="1"/>
                    <bitfield caption="TWI Address Enable" mask="0x01" name="TWAE"/>
                </register>
            </register-group>
        </module>
        <module caption="USART" name="USART">
            <register-group caption="USART" name="USART">
                <register caption="USART I/O Data Register" name="UDR" offset="0xC6" size="1" mask="0xFF" ocd-rw=""/>
                <register caption="USART Control and Status Register A" name="UCSRA" offset="0xC0" size="1" ocd-rw="R">
                    <bitfield caption="USART Receive Complete" mask="0x80" name="RXC"/>
                    <bitfield caption="USART Transmitt Complete" mask="0x40" name="TXC"/>
                    <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE"/>
                    <bitfield caption="Framing Error" mask="0x10" name="FE"/>
                    <bitfield caption="Data overRun" mask="0x08" name="DOR"/>
                    <bitfield caption="Parity Error" mask="0x04" name="UPE"/>
                    <bitfield caption="Double the USART transmission speed" mask="0x02" name="U2X"/>
                    <bitfield caption="Multi-processor Communication Mode" mask="0x01" name="MPCM"/>
                </register>
                <register caption="USART Control and Status Register B" name="UCSRB" offset="0xC1" size="1">
                    <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE"/>
                    <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE"/>
                    <bitfield caption="USART Data register Empty Interrupt Enable" mask="0x20" name="UDRIE"/>
                    <bitfield caption="Receiver Enable" mask="0x10" name="RXEN"/>
                    <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN"/>
                    <bitfield caption="Character Size" mask="0x04" name="UCSZ2"/>
                    <bitfield caption="Receive Data Bit 8" mask="0x02" name="RXB8"/>
                    <bitfield caption="Transmit Data Bit 8" mask="0x01" name="TXB8"/>
                </register>
                <register caption="USART Control and Status Register C" name="UCSRC" offset="0xC2" size="1">
                    <bitfield caption="USART Mode Select" mask="0xC0" name="UMSEL" values="COMM_USART_MODE"/>
                    <bitfield caption="Parity Mode Bits" mask="0x30" name="UPM" values="COMM_UPM_PARITY_MODE"/>
                    <bitfield caption="Stop Bit Select" mask="0x08" name="USBS" values="COMM_STOP_BIT_SEL"/>
                    <bitfield caption="Character Size" mask="0x06" name="UCSZ"/>
                    <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL"/>
                </register>
                <register caption="USART Control and Status Register D" name="UCSRD" offset="0xC3" size="1">
                    <bitfield caption="USART RX Start Interrupt Enable" mask="0x80" name="RXSIE"/>
                    <bitfield caption="USART RX Start Flag" mask="0x40" name="RXS"/>
                    <bitfield caption="USART RX Start Frame Detection Enable" mask="0x20" name="SFDE"/>
                </register>
                <register caption="USART Baud Rate Register  Bytes" name="UBRR" offset="0xC4" size="2" mask="0x0FFF"/>
            </register-group>
            <value-group caption="" name="COMM_USART_MODE">
                <value caption="Asynchronous Operation" name="VAL_0x00" value="0x00"/>
                <value caption="Synchronous Operation" name="VAL_0x01" value="0x01"/>
            </value-group>
            <value-group caption="" name="COMM_UPM_PARITY_MODE">
                <value caption="Disabled" name="VAL_0x00" value="0x00"/>
                <value caption="Reserved" name="VAL_0x01" value="0x01"/>
                <value caption="Enabled, Even Parity" name="VAL_0x02" value="0x02"/>
                <value caption="Enabled, Odd Parity" name="VAL_0x03" value="0x03"/>
            </value-group>
            <value-group caption="" name="COMM_STOP_BIT_SEL">
                <value caption="1-bit" name="VAL_0x00" value="0x00"/>
                <value caption="2-bit" name="VAL_0x01" value="0x01"/>
            </value-group>
        </module>
    </modules>
</target-description-file>
